Repository: MrThearMan/jwt-email-auth
Catalog: jwt_email_auth/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Server did not respond.
fi: Palvelin ei vastaa.

source: This user is not allowed to send another login code yet.
fi: Tämä käyttäjä ei voi vielä lähettää toista kirjautumiskoodia.

source: Maximum number of attempts reached. Try again in %(x)s minutes.
fi: Sallittu määrä kirjautumisyrityksiä ylitetty. Yritä uudeleen %(x)s minuutin päästä.

source: '%(claim)s' not found from the list of expected claims.
fi: '%(claim)s' ei löytynyt odotettujen arvojen joukosta.

source: Not allowed to update claim '%(claim)s'.
fi: Ei sallittu päivitystä arvolle '%(claim)s'

source: Data was corrupted.
fi: Data korruptoitunut.

source: Invalid token.
fi: Virheellinen tokeni.

source: JWT rotation
fi: JWT rotaatio

source: Signature has expired.
fi: Allekirjoitus on vahnentunut.

source: Error decoding signature.
fi: Virhe allekirjoituksen tulkitsemisessa.

source: Unexpected error.
fi: Odottamaton virhe.

source: No token found from request cookies.
fi: Pyyntöevästeistä ei löytynyt tokenia.

source: Invalid token type.
fi: Virheellinen tokenin tyyppi.

source: Token is no longer accepted.
fi: Tokenia ei enää hyväksytä.

source: No Authorization header found from request.
fi: Authorization headeria ei löytynyt.

source: Invalid Authorization header.
fi: Virheellinen Authorization header.

source: Invalid prefix.
fi: Virheellinen etuliite.

source: JWT decrypt failed.
fi: Tokenin salauksen purku epäonnistui

source: Invalid JWT format.
fi: Virheellinen tokenin muoto.

source: Cipher key not set.
fi: Salausavainta ei ole asetettu.

source: Invalid cipher key.
fi: Virheellinen salausavain.

source: Wrong cipher key.
fi: Väärä salausavain.

source: Failed to send login codes. Try again later.
fi: Ei voitu lähettää kirjautumiskoodia. Yritä uudelleen myöhemmin.

source: No login code found for '%(value)s'.
fi: Ei löydetty kirjautumiskoodia '%(value)s':lle.

source: Incorrect login code.
fi: Väärä kirjautumiskoodi.

source: Data was corrupted. Try to send another login code.
fi: Data korruptoitunut. Yritä lähettää uusi kirjautumiskoodi.
